from os import name, system


class Renderer:
    """Класс для отрисовки игры."""

    @staticmethod
    def clear_screen() -> None:
        """Метод для очистки консоля."""

        system('cls' if name == 'nt' else 'clear')

    def render_menu(self) -> None:
        """Отрисовка меню."""

        self.clear_screen()
        print("-" * 40 + '\n' +
              ' ' * 14 + "ЛАБИРИНТ" + '\n' +
              "-" * 40 + '\n'
              "\n1. Начать игру" + '\n'
              "2. Инструкция" + '\n'
              "3. Выход" + '\n'
              "\n" + "-" * 40)

    def render_instructions(self) -> None:
        """Отрисовка инструкции."""

        self.clear_screen()
        print("-" * 40 + "\n" +
              "             ИНСТРУКЦИЯ\n" +
              "-" * 40 +
              "\nЦель игры: найти выход из лабиринта.\n"
              "\nУправление:\n"
              "             ↑ - Вверх\n"
              "             ↓ - Вниз\n"
              "             ← - Влево\n"
              "             → - Вправо\n"              
              "             ESC - Вернуться в меню\n"
              "\nУровни сложности:\n"
              "                     Легкий    - маленький лабиринт (15x11)\n"
              "                     Средний   - средний лабиринт (21x15)\n"
              "                     Сложный   - большой лабиринт (31x21)\n"
              "\nОбозначения:\n"
              "              📕 - Старт\n"
              "              📗 - Выход\n"
              "               ☺- Игрок\n"
              "               █ - Стена\n"
              "\n" + "-" * 40)

        input("\nНажмите Enter для возврата в меню...")

    def render_level_selection(self) -> None:
        """Отрисовка выбора уровня."""

        self.clear_screen()
        print("-" * 40 + "\n" +
              "          ВЫБЕРИТЕ УРОВЕНЬ\n" +
              "-" * 40 + "\n" +
              "\n1. Легкий"
              "\n2. Средний"
              "\n3. Сложный"
              "\n4. Назад\n"
              "\n" + "-" * 40)

    def render_game(self, maze, player) -> None:
        """Отрисовка игрового поля.

        Args:
            player: Игрок(объект класса Player).
            maze: Объект текущего лабиринта.
        """

        self.clear_screen()
        print(f"Уровень: {maze.level_name} ({maze.get_size_info()})\n" +
              "-" * 50)

        start_y = 0
        end_y = maze.get_height()

        start_x = 0
        end_x = maze.get_width()

        # Если координаты совпадают с позицией игрока, то выводит "☺"
        # Иначе - выводит символ из лабиринта(стена, проход, старт, выход)
        for y in range(start_y, end_y):

            line = ""
            for x in range(start_x, end_x):
                if x == player.x and y == player.y:
                    line += "☺"
                else:
                    line += maze.grid[y][x]

            print("  " + line)

        print("\nУправление: стрелки - движение, ESC - меню")

    def render_level_complete(self, maze, is_last_level=False) -> str:
        """Отрисовка экрана завершения уровня."""

        self.clear_screen()
        print("-" * 40 + "\n" +
              "                ПОБЕДА!" +
              f"\nВы прошли лабиринт уровня: {maze.level_name}\n")

        if not is_last_level:
            print("\n" + "-" * 40 +
                  "\nВыберите действие:\n" +
                  "1. Следующий уровень\n" +
                  "2. Переиграть этот уровень\n" +
                  "3. Вернуться в меню\n" +
                  "\n" + "-" * 40)

            while True:
                choice = input("\nВаш выбор: ")

                match choice:
                    case '1':
                        return "next"
                    case '2':
                        return "restart"
                    case '3':
                        return "menu"
                    case _:
                        print("Некорректный выбор номера меню.")

        else:
            print("\n" + "-" * 40 +
                  "\nВы прошли ВСЕ уровни!\n" +
                  "-" * 40 +
                  "\nВыберите действие:\n" +
                  "1. Начать заново\n" +
                  "2. Выйти в меню\n" +
                  "\n" + "-" * 40)

            while True:
                choice = input("\nВаш выбор (1-2): ")

                match choice:
                    case '1':
                        return "restart_all"
                    case '2':
                        return "menu"
                    case _:
                        print("Некорректный выбор номера")
